Revit 2027 API
IFCUserDefinedPropertySet.ClearPropertySet Method
 Removes all properties from the property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearPropertySet()
Public Sub ClearPropertySet
public:
void ClearPropertySet()
member ClearPropertySet : unit -> unit
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace